
Процедура ДействияФормыОтчетСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ТабДок = ЭлементыФормы.ПолеТабличногоДокумента;
	Отчет(ТабДок);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура Отчет(ТабДок) Экспорт
	
	Макет = ВнешнийОтчетОбъект.ПолучитьМакет("Отчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	Для Каждого Док из Метаданные.Документы Цикл 
		
		Если не ПустаяСтрока(Запрос.Текст) Тогда 
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|ВЫБРАТЬ
		|	ТаблДок.Ссылка КАК Ссылка,
		|	ТаблДок.Проведен КАК Проведен,
		|	ТаблДок.ПометкаУдаления КАК ПометкаУдаления,
		|	ТИПЗНАЧЕНИЯ(ТаблДок.Ссылка) КАК ТипДока,
		|	1 КАК Кво
		|ИЗ
		|	Документ."+Док.Имя+" КАК ТаблДок
		|ГДЕ
		|	НЕ ТаблДок.ПометкаУдаления
		|";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДока
	|ИТОГИ
	|	СУММА(Кво)
	|ПО
	|	ТипДока,
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьТипДока = Макет.ПолучитьОбласть("ТипДока");
	ОбластьСсылка = Макет.ПолучитьОбласть("Ссылка");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаТипДока = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаТипДока.Следующий() Цикл
		ОбластьТипДока.Параметры.Заполнить(ВыборкаТипДока);
		ТабДок.Вывести(ОбластьТипДока, ВыборкаТипДока.Уровень());

		ВыборкаСсылка = ВыборкаТипДока.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаСсылка.Следующий() Цикл
			ОбластьСсылка.Параметры.Заполнить(ВыборкаСсылка);
			ТабДок.Вывести(ОбластьСсылка, ВыборкаСсылка.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры
