
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура КаталогФайловНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = НСтр("ru='Выберите каталог размещения файлов';uk='Виберіть каталог розміщення файлів'");
	Если Диалог.Выбрать() Тогда
		Элемент.Значение = Диалог.Каталог;
		Если Не Прав(СокрЛП(Элемент.Значение),1) = "\" Тогда
			Элемент.Значение = Элемент.Значение + "\";
		КонецЕсли;
	КонецЕсли;
		
	
КонецПроцедуры

Процедура ЗагрузитьИзображенияНажатие(Элемент)
	
	НайденныеФайлы = НайтиФайлы(СокрЛП(КаталогФайлов), "*.jpg"); //Надо уточнить, в каких форматах могут быть картинки и прописать расширения
	
	ИндПроц = 0;
	ЭлементыФормы.ИндикаторПроцесса.Значение = ИндПроц;
	ЭлементыФормы.ИндикаторПроцесса.МаксимальноеЗначение = НайденныеФайлы.Количество();
	
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		
		Артикул = СокрЛП(ТекФайл.ИмяБезРасширения);
		ПозицияНоменклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
		
		Если Не ПозицияНоменклатуры.Пустая() Тогда 
			
			//Проверим, нет ли картинки с наименованием = артикул номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХранилищеДополнительнойИнформации.Ссылка
			|ИЗ
			|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
			|ГДЕ
			|	ХранилищеДополнительнойИнформации.Объект = &Объект
			|	И ХранилищеДополнительнойИнформации.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", Артикул);
			Запрос.УстановитьПараметр("Объект", ПозицияНоменклатуры);
			
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				
				
				КартинкаНоменклатуры = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				КартинкаНоменклатуры.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				КартинкаНоменклатуры.ИмяФайла = СокрЛП(ТекФайл.Имя);
				КартинкаНоменклатуры.Объект = ПозицияНоменклатуры;
				КартинкаНоменклатуры.Наименование = Артикул;
				
				
				Попытка
					КартинкаНоменклатуры.Хранилище = Новый ХранилищеЗначения(Новый Картинка(ТекФайл.ПолноеИмя));
					
				Исключение
					Предупреждение(ОписаниеОшибки());
				КонецПопытки;
				
				Попытка
					КартинкаНоменклатуры.Записать();
				Исключение
					Предупреждение(ОписаниеОшибки());
				КонецПопытки;
				
			Иначе	
				
				Сообщить("Для номенклатуры " + ПозицияНоменклатуры.Наименование + " с артикулом " + Артикул+ " уже есть изображение. Файл не загружен");
				
			КонецЕсли;		   
		Иначе
			Сообщить("По наименованию " + Артикул + " не найден элемент справочника! 
			|Убедитесь, что имя файла с изображдением соответствует артикулу нужной номенклатуры!");
			
		КонецЕсли;
		
		ИндПроц = ИндПроц + 1;
		ЭлементыФормы.ИндикаторПроцесса.Значение = ИндПроц;
		
	КонецЦикла;	
	
	
КонецПроцедуры

Процедура ВыгрузитьИзображенияНажатие(Элемент)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ХранилищеДополнительнойИнформации.Объект.Артикул КАК Артикул,
		|	ХранилищеДополнительнойИнформации.Хранилище,
		|	1 КАК КоличествоФайлов,
		|	ХранилищеДополнительнойИнформации.Объект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ХранилищеДополнительнойИнформации.Объект.Ссылка) = ТИП(Справочник.Номенклатура)
		|ИТОГИ
		|	СУММА(КоличествоФайлов)
		|ПО
		|	Артикул";

	Результат = Запрос.Выполнить();

	ВыборкаАртикул = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ИндПроц = 0;
	ЭлементыФормы.ИндикаторПроцесса.Значение = ИндПроц;
	ЭлементыФормы.ИндикаторПроцесса.МаксимальноеЗначение = ВыборкаАртикул.Количество();
	
	Пока ВыборкаАртикул.Следующий() Цикл
		
		ИндПроц = ИндПроц + 1;
		ЭлементыФормы.ИндикаторПроцесса.Значение = ИндПроц;
		Артикул = ВыборкаАртикул.Артикул;
		Счетчик = 1;
		Выборка = ВыборкаАртикул.Выбрать();
		 
		
		Пока Выборка.Следующий() Цикл
			
			ИмяФайла = СокрЛП(КаталогФайлов) + СокрЛП(Артикул) + ".jpg";
			
			Файл = Новый Файл(ИмяФайла);    
			
			Если Файл.Существует() Тогда
				//Сообщить("Файл " + СокрЛП(Артикул) + ".jpg" + " уже есть в папке!");
				//Продолжить;
				  
				Счетчик = Счетчик + 1;
				ИмяФайла = СокрЛП(КаталогФайлов) + СокрЛП(Артикул) +"_" + СокрЛП(Счетчик) + ".jpg";
				Сообщить("У номенклатуры " +  СокрЛП(Выборка.Наименование) + " есть несколько изображений. " 
				+ СокрЛП(Счетчик)+ " по счету изображение сохранено под именем " + СокрЛП(Артикул) +"_" + СокрЛП(Счетчик) + ".jpg");
				
			КонецЕсли;
			
			ДвоичныеДанные = Выборка.Хранилище.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			
		КонецЦикла;
		
	КонецЦикла;

	
	
КонецПроцедуры
